Wann-99/my-dev-lab/src/esp32_develop/esp32_smart_car_app/firmware/sdkconfig.defaults
# ESP32-S3 N16R8 Configuration
CONFIG_IDF_TARGET="esp32s3"

# Flash Size 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# PSRAM Configuration (Octal for N16R8)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Compiler options
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# HTTP Server & WebSocket
CONFIG_HTTPD_WS_SUPPORT=y
